app/controllers/api/v1/trecips_controller.rb

def index
  trecips = Trecp.all
---
SELECT `trecps`.* FROM `trecps`