app/controllers/api/v1/tusers_controller.rb

  def index
    tusers = Tuser.all
---
SELECT `tusers`.* FROM `tusers`

  def create
    tuser = Tuser.new(tuser_params)
    if tuser.save
---
INSERT INTO `tusers` (`name`, `pass`, `jointime`, `created_at`, `updated_at`) VALUES ('inputest', 'pastest', '2020-11-26', '2020-11-28 13:14:35.189513', '2020-11-28 13:14:35.189513')

  def update
      if @tuser.update_attributes(tuser_params)
---
UPDATE `tusers` SET `tusers`.`pass` = 'aaaaaaaaaaaa', `tusers`.`updated_at` = '2020-11-28 14:07:32.285002' WHERE `tusers`.`id` = 1

  def destroy
    @tuser.destroy!
---
DELETE FROM `tusers` WHERE `tusers`.`id` = 5

    def set_tuser
      @tuser = Tuser.find(params[:id])
---
SELECT `tusers`.* FROM `tusers` WHERE `tusers`.`id` = 1 LIMIT 1